#include<stdio.h>
int main()
{
	int a = 3;//初始赋值
	int d = 5;
	int c = 6;
	c = d = a + 6;//连续赋值，等同于d=a+6;c=d
	printf("%d\n", 11 % 5);//求模（求余数）
	printf("%d\n", -11 % 5);//负数求模由第一个数决定正负...-1
	printf("%d\n", 11 % -5);//...1
	a = a + 3;
	a += 3;//复合赋值与上面一样
	a++;//a+1
	//前置++：a=a+1;b=a(--同理）
	int b = ++a;
	printf("a=%d", a);
	printf("b=%d", b);//结果都是4
	//后置++：b=a;a=a+1（--同理）
	int e = a++;
	printf("a=%d", a);
	printf("e=%d", e);//a=4;e=3
	int g = -10;
	printf("%d", +g);//结果-10,正号不会对结果有影响
	printf("%d", -g);//结果10，负负得正
	//强制类型转换
	//int a = 3.14;
	//a的是int类型, 3.14是double类型，两边的类型不⼀致，编译器会报警告
	//为了消除这个警告，我们可以使⽤强制类型转换：
	int f = (int)3.14;//...3
	//俗话说，强扭的⽠不甜，我们使⽤强制类型转换都是万不得已的时候使⽤，如果不需要强制类型转化
	//就能实现代码，这样⾃然更好的。
	return 0;
}