#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
int main()
{
	int a = 0;
	int b = 0;
	float f1 = 0.0;
	float f2 = 0.0;
	scanf("%d %d %f %f", &a, &b, &f1, &f2);//想同时输入多个数，就在各%之间加空格隔开
	//%之间是空格，则输入数据用空格隔开；%之间是，则输入数据用，隔开
	printf("%d %d %f %f", a, b, f1, f2);//scanf() 处理数值占位符时，会⾃动过滤空⽩字符，包括空格、制表符、换⾏符等。


	int x;
	float y;

	// ⽤⼾输⼊ " -13.45e12# 0"
	//scanf() 处理⽤⼾输⼊的原理是，⽤⼾的输⼊先放⼊缓存，等到按下回⻋键后，按照占位符对缓存进行解读
	//解读⽤⼾输⼊时，会从上⼀次解读遗留的第⼀个字符开始，直到读完缓存，或者遇到第⼀个不符合条件的字符为止
	scanf("%d", &x);
	printf("%d\n", x);//....-13
	scanf("%f", &y);
	printf("%f\n", y);//...449999994880.000000,实际结果应该是045乘10的12次方，但由于浮点数在内存中无法精确保存


	//若scanf读一半想让它停下来，按三次CTRL+z
	return 0;
}